package Remember.Operators;

//1. Проинициализировать 3 целочисленных числа:
//	 a = 2_123_000 
//	 b = 100
//	 c = 234
//	 Найти a / b * c
//	 Ответ: (4967820)
public class LetsTask1 {
	public static void main(String[] args) {
		int a = 2123000, b = 100, c = 234;
		System.out.println(a / b * c);

	}
}
