package lesson4;
//1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.

public class CyckeTask {
	public static void main(String[] args) {
		int n = 21;
	    for(int i = 10; i<n; i++){
	      int result = i*i;
	      System.out.println(i + "*" + i + "=" + result);
	    }
	
	}
}
