package lesson4;

public class Taska {

	public static void main(String[] args) {
				
					System.out.println("I like Java!!!".contains("Java") + "_method contain");
					
					System.out.println("I like Java!!!".toLowerCase()+ "_method lower");
					System.out.println();
					
					System.out.println("I like Java!!!".toUpperCase()+ "_ Method Upper");
					
					System.out.println();
					System.out.println("I like Java!!!".substring(5, 9)+ "_ Method String.substring()");	
		}
	}

/* Найти позицию подстроки “Java” в строке “I like Java!!!”.
ж) Заменить все символы “а” на “о”. 
з) Преобразуйте строку к верхнему регистру.
и) Преобразуйте строку к нижнему регистру.
к) Вырезать строку Java c помощью метода String.substring().
*/