// 8. Даны натуральные числа от 20 до 50
// Напечатать те из них, которые делятся на 3,но не делятся на 5.
package lesson4;

public class Task8 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for (int i = 20; i<50; i++) {
		if (i%3 ==0) {
			System.out.println(i);
			
		}
		}
		

	}

}
